In [1]:
import pandas as pd 
import pandas as pd

data = {
    'Product': ['Laptop', 'Phone', 'Tablet'],
    'Jan_Sales': [100, 150, 120],
    'Feb_Sales': [130, 200, 150],
    'Mar_Sales': [180, 220, 170]
}

df = pd.DataFrame(data)
df

  Product  Jan_Sales  Feb_Sales  Mar_Sales
0  Laptop        100        130        180
1   Phone        150        200        220
2  Tablet        120        150        170

In [3]:
stacked = df.stack()
stacked

0  Product      Laptop
   Jan_Sales       100
   Feb_Sales       130
   Mar_Sales       180
1  Product       Phone
   Jan_Sales       150
   Feb_Sales       200
   Mar_Sales       220
2  Product      Tablet
   Jan_Sales       120
   Feb_Sales       150
   Mar_Sales       170
dtype: object

In [4]:
unstacked = stacked.unstack()
unstacked

  Product Jan_Sales Feb_Sales Mar_Sales
0  Laptop       100       130       180
1   Phone       150       200       220
2  Tablet       120       150       170

In [5]:
import pandas as pd

data = {
    'Store_Location': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles', 'Chicago', 'New York', 'Chicago'],
    'Product_Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing', 'Electronics', 'Electronics', 'Clothing', 'Clothing'],
    'Quantity_Sold': [100, 150, 200, 80, 250, 300, 120, 90]
}

df = pd.DataFrame(data)
df

  Store_Location Product_Category  Quantity_Sold
0       New York      Electronics            100
1    Los Angeles         Clothing            150
2       New York      Electronics            200
3        Chicago         Clothing             80
4    Los Angeles      Electronics            250
5        Chicago      Electronics            300
6       New York         Clothing            120
7        Chicago         Clothing             90

In [8]:
cross = pd.crosstab(df['Store_Location'],df['Product_Category'],aggfunc='sum',margins=True,)

ValueError: aggfunc cannot be used without values.